OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic16/pic18f8527.h
#define _PORTH_RH0              0x01
#define _PORTH_A16              0x01
#define _PORTH_RH1              0x02
#define _PORTH_A17              0x02
#define _PORTH_RH2              0x04
#define _PORTH_A18              0x04
#define _PORTH_RH3              0x08
#define _PORTH_A19              0x08
#define _PORTH_RH4              0x10
#define _PORTH_AN12             0x10
#define _PORTH_P3C              0x10
#define _PORTH_RH5              0x20
#define _PORTH_AN13             0x20
#define _PORTH_P3B              0x20
#define _PORTH_RH6              0x40
#define _PORTH_AN14             0x40
#define _PORTH_P1C              0x40
#define _PORTH_RH7              0x80
#define _PORTH_AN15             0x80
#define _PORTH_P1B              0x80

//==============================================================================


//==============================================================================
//        PORTJ Bits

extern __at(0x0F88) __sfr PORTJ;

typedef union
  {
  struct
    {
    unsigned RJ0                : 1;
    unsigned RJ1                : 1;
    unsigned RJ2                : 1;
    unsigned RJ3                : 1;
    unsigned RJ4                : 1;
    unsigned RJ5                : 1;
    unsigned RJ6                : 1;
    unsigned RJ7                : 1;
    };

  struct
    {
    unsigned ALE                : 1;
    unsigned OE                 : 1;
    unsigned WRL                : 1;
    unsigned WRH                : 1;
    unsigned BA0                : 1;
    unsigned CE                 : 1;
    unsigned LB                 : 1;
    unsigned UB                 : 1;
    };

  struct
    {
    unsigned                    : 1;
    unsigned NOT_OE             : 1;
    unsigned NOT_WRL            : 1;
    unsigned NOT_WRH            : 1;
    unsigned                    : 1;
    unsigned NOT_CE             : 1;
    unsigned NOT_LB             : 1;
    unsigned NOT_UB             : 1;
    };
  } __PORTJbits_t;

extern __at(0x0F88) volatile __PORTJbits_t PORTJbits;

#define _PORTJ_RJ0              0x01
#define _PORTJ_ALE              0x01
#define _PORTJ_RJ1              0x02
#define _PORTJ_OE               0x02
#define _PORTJ_NOT_OE           0x02
#define _PORTJ_RJ2              0x04
#define _PORTJ_WRL              0x04
#define _PORTJ_NOT_WRL          0x04
#define _PORTJ_RJ3              0x08
#define _PORTJ_WRH              0x08
#define _PORTJ_NOT_WRH          0x08
#define _PORTJ_RJ4              0x10
#define _PORTJ_BA0              0x10
#define _PORTJ_RJ5              0x20
#define _PORTJ_CE               0x20
#define _PORTJ_NOT_CE           0x20
#define _PORTJ_RJ6              0x40
#define _PORTJ_LB               0x40
#define _PORTJ_NOT_LB           0x40
#define _PORTJ_RJ7              0x80
#define _PORTJ_UB               0x80
#define _PORTJ_NOT_UB           0x80

//==============================================================================


//==============================================================================
//        LATA Bits

extern __at(0x0F89) __sfr LATA;

typedef struct
  {
  unsigned LATA0                : 1;
  unsigned LATA1                : 1;
  unsigned LATA2                : 1;
  unsigned LATA3                : 1;
  unsigned LATA4                : 1;
  unsigned LATA5                : 1;
  unsigned LATA6                : 1;
  unsigned LATA7                : 1;
  } __LATAbits_t;

extern __at(0x0F89) volatile __LATAbits_t LATAbits;

#define _LATA0                  0x01
#define _LATA1                  0x02
#define _LATA2                  0x04
#define _LATA3                  0x08
#define _LATA4                  0x10
#define _LATA5                  0x20
#define _LATA6                  0x40
#define _LATA7                  0x80

//==============================================================================


//==============================================================================
//        LATB Bits

extern __at(0x0F8A) __sfr LATB;

typedef struct
  {
  unsigned LATB0                : 1;
  unsigned LATB1                : 1;
  unsigned LATB2                : 1;
  unsigned LATB3                : 1;
  unsigned LATB4                : 1;
  unsigned LATB5                : 1;
  unsigned LATB6                : 1;
  unsigned LATB7                : 1;
  } __LATBbits_t;

extern __at(0x0F8A) volatile __LATBbits_t LATBbits;

#define _LATB0                  0x01
#define _LATB1                  0x02
#define _LATB2                  0x04
#define _LATB3                  0x08
#define _LATB4                  0x10
#define _LATB5                  0x20
#define _LATB6                  0x40
#define _LATB7                  0x80

//==============================================================================


//==============================================================================
//        LATC Bits

extern __at(0x0F8B) __sfr LATC;

typedef struct
  {
  unsigned LATC0                : 1;
  unsigned LATC1                : 1;
  unsigned LATC2                : 1;
  unsigned LATC3                : 1;
  unsigned LATC4                : 1;
  unsigned LATC5                : 1;
  unsigned LATC6                : 1;
  unsigned LATC7                : 1;
  } __LATCbits_t;

extern __at(0x0F8B) volatile __LATCbits_t LATCbits;

#define _LATC0                  0x01
#define _LATC1                  0x02
#define _LATC2                  0x04
#define _LATC3                  0x08
#define _LATC4                  0x10
#define _LATC5                  0x20
#define _LATC6                  0x40
#define _LATC7                  0x80

//==============================================================================


//==============================================================================
//        LATD Bits

extern __at(0x0F8C) __sfr LATD;

typedef struct
  {
  unsigned LATD0                : 1;
  unsigned LATD1                : 1;
  unsigned LATD2                : 1;
  unsigned LATD3                : 1;
  unsigned LATD4                : 1;
  unsigned LATD5                : 1;
  unsigned LATD6                : 1;
  unsigned LATD7                : 1;
  } __LATDbits_t;

